### maria db 연결하기
+ maria db 연결을 위해서 라이브러리를 설치
+ pip install pymysql
+ 설치한 라이브러리를 import 하여 사용 -> import pymysql

In [1]:
import pymysql

In [14]:
# 1. 파이썬에 디비 연결
conn = pymysql.connect(host='localhost',user='study_user',passwd='mariadb',db='study_db',charset='utf8')

In [9]:
# 쿼리 조회하기

# 쿼리의 결과 및 실행되고 있는 위치 정보를 포함하는 객체
cursor = conn.cursor(pymysql.cursors.DictCursor)
# 실행할 sql
sql = 'SELECT * FROM EMP'

# 실제로 쿼리를 실행하는 함수
cursor.execute(sql)

# 조회된 모든 데이터를 조회
result1 = cursor.fetchall()
print(result1)

[{'EMPNO': 1001, 'ENAME': '김사랑', 'JOB': '사원', 'MGR': 1013, 'HIREDATE': datetime.datetime(2007, 3, 1, 0, 0), 'SAL': 500, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 1002, 'ENAME': '한예슬', 'JOB': '대리', 'MGR': 1005, 'HIREDATE': datetime.datetime(2007, 4, 2, 0, 0), 'SAL': 250, 'COMM': 80, 'DEPTNO': 30}, {'EMPNO': 1003, 'ENAME': '오지호', 'JOB': '과장', 'MGR': 1005, 'HIREDATE': datetime.datetime(2005, 2, 10, 0, 0), 'SAL': 500, 'COMM': 100, 'DEPTNO': 30}, {'EMPNO': 1004, 'ENAME': '이병헌', 'JOB': '부장', 'MGR': 1008, 'HIREDATE': datetime.datetime(2003, 9, 2, 0, 0), 'SAL': 800, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 1005, 'ENAME': '신동협', 'JOB': '과장', 'MGR': 1005, 'HIREDATE': datetime.datetime(2005, 4, 7, 0, 0), 'SAL': 450, 'COMM': 200, 'DEPTNO': 30}, {'EMPNO': 1006, 'ENAME': '장동건', 'JOB': '부장', 'MGR': 1008, 'HIREDATE': datetime.datetime(2003, 10, 9, 0, 0), 'SAL': 480, 'COMM': None, 'DEPTNO': 30}, {'EMPNO': 1007, 'ENAME': '이문세', 'JOB': '부장', 'MGR': 1008, 'HIREDATE': datetime.datetime(2004, 1, 8, 0, 0), 'SAL': 520, 'COMM': None, 'DEPTNO': 10}, {'EMPNO': 1008, 'ENAME': '감우성', 'JOB': '차장', 'MGR': 1003, 'HIREDATE': datetime.datetime(2004, 3, 8, 0, 0), 'SAL': 500, 'COMM': 0, 'DEPTNO': 30}, {'EMPNO': 1009, 'ENAME': '안성기', 'JOB': '사장', 'MGR': None, 'HIREDATE': datetime.datetime(1996, 10, 4, 0, 0), 'SAL': 1200, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 1010, 'ENAME': '이병헌', 'JOB': '과장', 'MGR': 1003, 'HIREDATE': datetime.datetime(2005, 4, 7, 0, 0), 'SAL': 500, 'COMM': None, 'DEPTNO': 10}, {'EMPNO': 1011, 'ENAME': '조향기', 'JOB': '사원', 'MGR': 1007, 'HIREDATE': datetime.datetime(2007, 3, 1, 0, 0), 'SAL': 280, 'COMM': None, 'DEPTNO': 30}, {'EMPNO': 1012, 'ENAME': '강혜정', 'JOB': '사원', 'MGR': 1006, 'HIREDATE': datetime.datetime(2007, 8, 9, 0, 0), 'SAL': 500, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 1013, 'ENAME': '박중훈', 'JOB': '부장', 'MGR': 1003, 'HIREDATE': datetime.datetime(2002, 10, 9, 0, 0), 'SAL': 760, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 1014, 'ENAME': '조인성', 'JOB': '사원', 'MGR': 1006, 'HIREDATE': datetime.datetime(2007, 11, 9, 0, 0), 'SAL': 250, 'COMM': None, 'DEPTNO': 10}]

In [6]:
for i in result1 :
    print(i)

(1001, '김사랑', '사원', 1013, datetime.datetime(2007, 3, 1, 0, 0), 500, None, 20)
(1002, '한예슬', '대리', 1005, datetime.datetime(2007, 4, 2, 0, 0), 250, 80, 30)
(1003, '오지호', '과장', 1005, datetime.datetime(2005, 2, 10, 0, 0), 500, 100, 30)
(1004, '이병헌', '부장', 1008, datetime.datetime(2003, 9, 2, 0, 0), 800, None, 20)
(1005, '신동협', '과장', 1005, datetime.datetime(2005, 4, 7, 0, 0), 450, 200, 30)
(1006, '장동건', '부장', 1008, datetime.datetime(2003, 10, 9, 0, 0), 480, None, 30)
(1007, '이문세', '부장', 1008, datetime.datetime(2004, 1, 8, 0, 0), 520, None, 10)
(1008, '감우성', '차장', 1003, datetime.datetime(2004, 3, 8, 0, 0), 500, 0, 30)
(1009, '안성기', '사장', None, datetime.datetime(1996, 10, 4, 0, 0), 1200, None, 20)
(1010, '이병헌', '과장', 1003, datetime.datetime(2005, 4, 7, 0, 0), 500, None, 10)
(1011, '조향기', '사원', 1007, datetime.datetime(2007, 3, 1, 0, 0), 280, None, 30)
(1012, '강혜정', '사원', 1006, datetime.datetime(2007, 8, 9, 0, 0), 500, None, 20)
(1013, '박중훈', '부장', 1003, datetime.datetime(2002, 10, 9, 0, 0), 760, None, 20)
(1014, '조인성', '사원', 1006, datetime.datetime(2007, 11, 9, 0, 0), 250, None, 10)

In [13]:
conn.close()

In [12]:
import pandas as pd
df = pd.DataFrame(result1)
df

    EMPNO ENAME JOB     MGR   HIREDATE   SAL   COMM  DEPTNO
0    1001   김사랑  사원  1013.0 2007-03-01   500    NaN      20
1    1002   한예슬  대리  1005.0 2007-04-02   250   80.0      30
2    1003   오지호  과장  1005.0 2005-02-10   500  100.0      30
3    1004   이병헌  부장  1008.0 2003-09-02   800    NaN      20
4    1005   신동협  과장  1005.0 2005-04-07   450  200.0      30
5    1006   장동건  부장  1008.0 2003-10-09   480    NaN      30
6    1007   이문세  부장  1008.0 2004-01-08   520    NaN      10
7    1008   감우성  차장  1003.0 2004-03-08   500    0.0      30
8    1009   안성기  사장     NaN 1996-10-04  1200    NaN      20
9    1010   이병헌  과장  1003.0 2005-04-07   500    NaN      10
10   1011   조향기  사원  1007.0 2007-03-01   280    NaN      30
11   1012   강혜정  사원  1006.0 2007-08-09   500    NaN      20
12   1013   박중훈  부장  1003.0 2002-10-09   760    NaN      20
13   1014   조인성  사원  1006.0 2007-11-09   250    NaN      10

In [22]:
cursor = conn.cursor(pymysql.cursors.DictCursor)

sql = "INSERT INTO PYTHON_BOARD(BOARD_NUM, TITLE, WRITER, READ_CNT)VALUES(2,'테스트','ADMIN',5)"

cursor.execute(sql)
conn.commit()

# print(cursor.fetchall())

In [25]:
# 키보드로 글번호, 제목, 작성자, 조회수를 입력받아
# 입력받은 데이터로 insert 되도록 코드를 작성






sql = f"INSERT INTO PYTHON_BOARD VALUES({input('글 번호 입력')},'{input('제목 입력')}','{input('작성자 입력')}',{input('조회수 입력')})"

cursor.execute(sql)
conn.commit()